artillery.yaml
config:
  target: "{{ $env.BASE_URL }}"
  phases:
    - name: warm-up
      duration: 20
      arrivalRate: 2
      maxVusers: 10
  engines:
    playwright:
      aggregateByName: true
      contextOptions:
        baseURL: "{{ $env.BASE_URL }}"
  processor: "./processor.ts"
  environments:
    local:
      phases:
        - duration: 30
          arrivalRate: 1
          maxVusers: 5
    preview:
      phases:
        - duration: 30
          arrivalRate: 1
          maxVusers: 10
    production:
      phases:
        - duration: 30
          arrivalRate: 2
          maxVusers: 10
  plugins:
    ensure: {}

  # NOTE - https://www.artillery.io/docs/reference/extensions/ensure
  ensure:
    thresholds:
      - "browser.page.FCP.load HK Drama page.p99": 2000
      - "browser.page.FCP.load HK Variety page.p99": 2000
      - "browser.page.FCP.load KR Drama page.p99": 2000

scenarios:
  - name: load home page
    engine: playwright
    testFunction: "loadHomePage"
  - name: load HK Drama page
    engine: playwright
    testFunction: "loadHKDramaCategoryPage"
  - name: load HK Variety page
    engine: playwright
    testFunction: "loadHKVarietyCategoryPage"
  - name: load KR Drama page
    engine: playwright
    testFunction: "loadKRDramaCategoryPage"